Ran Plan for project: `ecr/zerone-id/ap-northeast-2` dir: `terraform/ecr/zerone-id/ap-northeast-2` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_ecr_repository.demo will be created
+ resource "aws_ecr_repository" "demo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "demo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.sample will be destroyed
  # (because aws_ecr_repository.sample is not in configuration)
- resource "aws_ecr_repository" "sample" {
      - arn                  = "arn:aws:ecr:ap-northeast-2:066346343248:repository/sample" -> null
      - id                   = "sample" -> null
      - image_tag_mutability = "IMMUTABLE" -> null
      - name                 = "sample" -> null
      - registry_id          = "066346343248" -> null
      - repository_url       = "066346343248.dkr.ecr.ap-northeast-2.amazonaws.com/sample" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository_policy.demo will be created
+ resource "aws_ecr_repository_policy" "demo" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::066346343248:root",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "demo"
    }

  # aws_ecr_repository_policy.sample will be destroyed
  # (because aws_ecr_repository_policy.sample is not in configuration)
- resource "aws_ecr_repository_policy" "sample" {
      - id          = "sample" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:DescribeRepositories",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:ListImages",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::066346343248:root",
                            ]
                        }
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "066346343248" -> null
      - repository  = "sample" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ecr/zerone-id/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-735438840.ap-northeast-2.elb.amazonaws.com/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fecr%252Fzerone-id%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ecr/zerone-id/ap-northeast-2`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
